#include <iostream>
using namespace std;

int main() {
	setlocale(0, "");
	int sum = 0, vivod;

	cout << "Первый элемент в таблице Менделеева — это…\n" <<
		"1.Железо 2.Магний 3.Водород " << endl;
	cin >> vivod;
	vivod == 3 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "Кто открыл Америку?\n" <<
		"1.Диего Колон 2.Христофор Колумб 3.Васко да Гама " << endl;
	cin >> vivod;
	vivod == 2 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "Как называется корабль Джека Воробья из фильма «Пираты Карибского моря»?\n" <<
		"1.Черная жемчужина 2.Месть королевы Анны 3.Летучий Голландец" << endl;
	cin >> vivod;
	vivod == 1 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "Какая планета расположена ближе всех к Солнцу ? \n" <<
		"1.Меркурий 2.Венера 3.Марс" << endl;
	cin >> vivod;
	vivod == 1 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "Как правильно поставить ударение?\n" <<
		"1.КрАпива 2.КрапИва 3.КрапивА " << endl;
	cin >> vivod;
	vivod == 2 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "Что такое режим КТО.\n" <<
		"1.Режим контртеррористической операции 2.КазТрансОйл 3. Камера термической обработки " << endl;
	cin >> vivod;
	vivod == 1 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "Сколько сопряжений имеет глагол в русском языке?\n" <<
		"1.2 2.3 3.4 " << endl;
	cin >> vivod;
	vivod == 1 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "Сколько клеток на шахматной доске?\n" <<
		"1.64 2.32 3.1 " << endl;
	cin >> vivod;
	vivod == 1 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "Что быстрее: свет или звук?\n" <<
		"1.Звук 2.Поезд 3.Свет " << endl;
	cin >> vivod;
	vivod == 3 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "Что такое вайбер?\n" <<
		"1.Игра 2.Бесплатные и безопасные звонки и сообщения по всему миру 3.Водород " << endl;
	cin >> vivod;
	vivod == 2 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "Предлагаем начать с простого – определения частей речи. Одно из этих слов не является междометием?n" <<
		"1.Увы 2.Физкульт-привет 3.Авось " << endl;
	cin >> vivod;
	vivod == 3 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "Правила русского языка не всегда отличаются единообразием. Вот и одно из этих слов написано с ошибкой?\n" <<
		"1.Пол-четверти 2.Пол-Чехии 3.Пол-лекции " << endl;
	cin >> vivod;
	vivod == 1 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "На какой реке стоит город Багдад?\n" <<
		"1.Тигр 2.Ефрат 3.Лена " << endl;
	cin >> vivod;
	vivod == 1 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "В каком созвездии находится звезда Бетельгейзе?\n" <<
		"1.Стрелец 2.Водолей 3.Орион " << endl;
	cin >> vivod;
	vivod == 3 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "Как называется склонность к откладыванию дел на потом?\n" <<
		"1.Прокрастинация 2.Деперссия 3.Приапизм " << endl;
	cin >> vivod;
	vivod == 1 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "В какое море впадает Рейн?\n" <<
		"1.Черное 2.Северное 3.Лаптевых " << endl;
	cin >> vivod;
	vivod == 2 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "Какой из американских штатов имеет самую большую площадь?\n" <<
		"1.Аляска 2.Оклахома 3.Техас " << endl;
	cin >> vivod;
	vivod == 1 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "В какой стране мира пьют больше всего пива?\n" <<
		"1.Россия 2.Германия 3.Чехия " << endl;
	cin >> vivod;
	vivod == 3 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "Столицей какого государства является Ханой?\n" <<
		"1.Таджиистан 2.Венисуэла 3.Вьетнам " << endl;
	cin >> vivod;
	vivod == 3 ? cout << "Верно!\n" : cout << "Неверно!" << endl;
	cout << "Население Аляски?\n" <<
		"1.324532532 2.150000 3.1400000 " << endl;
	cin >> vivod;
	vivod == 3 ? cout << "Верно!\n" : cout << "Неверно!" << endl;



	return 0;
}





